БухЭксп/Reports/CW_СтатистикаНахожденияДокументаВСтатусах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_СтатистикаНахожденияДокументаВСтатусах</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДокументовДляОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СтатусыДокументов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ВладельцыСтатуса</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Reports/CW_СтатистикаНахожденияДокументаВСтатусах/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ИдентификаторОбъекта", 		Отчет.ИдентификаторОбъекта);
	
	АдресДокументовДляОтбора = Неопределено;
	Параметры.Свойство("АдресДокументовДляОтбора", АдресДокументовДляОтбора);
	
	Если ЭтоАдресВременногоХранилища(АдресДокументовДляОтбора) Тогда
		МассивДокументов = ПолучитьИзВременногоХранилища(АдресДокументовДляОтбора);
		Отчет.АдресДокументовДляОтбора  = ПоместитьВоВременноеХранилище(МассивДокументов, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Отчет.ИдентификаторОбъекта.Пустая() Тогда
		ПоказатьПредупреждение(,"Отчет не предназанчен для самостоятельного использвования!");
		Отказ = Истина;
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	// отключаем стандартный механизм
	СтандартнаяОбработка = Ложь;
	// готовим объект обрабатывающий расшифровку
	// в первый параметр указываем адрес хранилища данных расшифровки (который мы подготовили при формировании отчета)
	// во второй параметр настройки нашего отчета
	//ОбработкаРасшифровки =  Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(Отчет));
	
	ПараметрыВыполняемогоДействия = ПолучитьВыполняемоеДействие(Расшифровка, ДанныеРасшифровки);
	
	ВыполняемоеДействие = ПараметрыВыполняемогоДействия.Получить("ВыполняемоеДействие");
	
	Если ВыполняемоеДействие = "ОткрытьЗначение" Тогда
		
		Значение = ПараметрыВыполняемогоДействия.Получить("Значение");
		Если Значение <> Неопределено Тогда
			ПоказатьЗначение(, Значение);
		КонецЕсли;
		
	ИначеЕсли ВыполняемоеДействие = "ИсторияСтатусов" Тогда
		
		Значение = ПараметрыВыполняемогоДействия.Получить("Значение");
		
		Если Значение <> Неопределено Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЗначениеОтбора", 	Значение);
			ПараметрыФормы.Вставить("Отбор",			Новый Структура("Документ", Значение));
			
			ОткрытьФорму("РегистрСведений.CW_СтатусыДокументов.Форма.ФормаСпискаИстория", ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВыполняемоеДействие(Расшифровка, АдресДанныеРасшифровки)
	
	СтруктураДействий = Новый Соответствие;
	
	ДанныеРасшифровкиКомпоновкиДанных 	= ПолучитьИзВременногоХранилища(АдресДанныеРасшифровки);
	ЗначенияПолейРасшифровки 			= ДанныеРасшифровкиКомпоновкиДанных.Элементы[Расшифровка];
	
	ПоляРасшифровки = ЗначенияПолейРасшифровки.ПолучитьПоля();
	Если  ПоляРасшифровки.Найти("ДниСтатуса")<> Неопределено Тогда
		ЗначениеРасшифровки = ПолучитьЗначениеПоляРасшифровки(ЗначенияПолейРасшифровки);
		
		СтруктураДействий.Вставить("ВыполняемоеДействие",	"ИсторияСтатусов");
		СтруктураДействий.Вставить("Значение", 				ЗначениеРасшифровки);
	Иначе
		
		ПолеРасшифровки = ПоляРасшифровки.Найти("Ссылка"); 
		Если ПолеРасшифровки = Неопределено Тогда
			ЗначениеРасшифровки = ПолучитьЗначениеПоляРасшифровки(ЗначенияПолейРасшифровки);
			
			СтруктураДействий.Вставить("ВыполняемоеДействие",	"ОткрытьЗначение");
			СтруктураДействий.Вставить("Значение", 				ЗначениеРасшифровки);
		Иначе
			СтруктураДействий.Вставить("ВыполняемоеДействие",	"ОткрытьЗначение");
			СтруктураДействий.Вставить("Значение", 				ПолеРасшифровки.Значение);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураДействий;
	
КонецФункции

&НаСервере
Функция ПолучитьЗначениеПоляРасшифровки(ЗначенияПолейРасшифровки)
	
	мРодители =  ЗначенияПолейРасшифровки.ПолучитьРодителей();
	Для Каждого ЭлементРасшифровки из мРодители Цикл
		ПоляЭлементаРасшифровки = ЭлементРасшифровки.ПолучитьПоля();
		
		ПолеРасшифровки =  ПоляЭлементаРасшифровки.Найти("Ссылка");
		Если ПолеРасшифровки <> Неопределено Тогда
			Возврат ПолеРасшифровки.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРасшифровку(ВыбранноеДействие,ВыбранноеЗначение,Параметр3) Экспорт

	// поле выбора действия, обрабаытваем нужные нам манипуляции
	// в нашем случае можно этого не делать, так как у нас доступно только действие "ОткрытьЗначение"
	Если ВыбранноеДействие <> ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет Тогда
		Если ВыбранноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
			// в режиме запрета модальности используем "ПоказатьЗначение"
			ПоказатьЗначение(,ВыбранноеЗначение);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Расшифровка = Неопределено;
КонецПроцедуры
